# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Membentuk Data Frame dari Dictionary

In [3]:
pd.DataFrame({'col1':[1, 2, 3, 4], 
              'col2':[5, 6, 7, 8]})

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

# Membentuk Data Frame dari Numpy Array

In [5]:
n_rows = 5
n_cols = 3

arr = np.random.randint(1, 20, size=(n_rows, n_cols))
arr

array([[14,  6, 13],
       [14,  4, 14],
       [12, 15,  6],
       [ 5,  3, 15],
       [11,  1, 19]])

In [7]:
pd.DataFrame(arr, columns=tuple('ABC'))

    A   B   C
0  14   6  13
1  14   4  14
2  12  15   6
3   5   3  15
4  11   1  19

# Membentuk Data Frame dengan memanfaatkan pandas.util.testing

In [21]:
n_rows = 30 
n_cols = 4 
columns = list('ABCD')

data = np.random.randn(n_rows, n_cols)

df = pd.DataFrame(data, columns=columns)

df.head()

          A         B         C         D
0  0.337230 -0.165900 -0.942327  0.031772
1  0.641138  0.653577 -1.349146  0.123818
2  0.019336 -0.981871  0.617868  3.099765
3 -1.083249  0.019483  0.425203 -1.470475
4  0.059924 -1.711507  0.073543  2.185343

In [23]:
n_rows = 5 

data = {
    'A': np.random.randn(n_rows),                 
    'B': np.arange(1, n_rows + 1),                
    'C': pd.date_range('2024-01-01', periods=n_rows), 
    'D': ['foo', 'bar', 'baz', 'qux', 'quux']    
}

df = pd.DataFrame(data)

df.head()

          A  B          C     D
0  1.173131  1 2024-01-01   foo
1  0.186745  2 2024-01-02   bar
2  2.038403  3 2024-01-03   baz
3 -1.762365  4 2024-01-04   qux
4 -0.703810  5 2024-01-05  quux

In [25]:
n_rows = 30  
n_cols = 4   
columns = list('ABCD')  

time_index = pd.date_range(start='2024-01-01', periods=n_rows, freq='D')  

df = pd.DataFrame(np.random.randn(n_rows, n_cols), index=time_index, columns=columns)

df.head()

                   A         B         C         D
2024-01-01 -1.064796  0.044601 -0.321810  0.757334
2024-01-02 -0.155973 -1.355990 -0.954172  0.046871
2024-01-03  0.320048  1.816628  0.845137  1.226674
2024-01-04 -0.742491 -0.040032 -0.554313 -0.670841
2024-01-05  1.080688  0.457033  1.498119 -1.807044

In [27]:
n_rows = 5
n_cols = 4

data = np.random.randn(n_rows, n_cols)

df = pd.DataFrame(data, columns=list('ABCD'))

df.iloc[0, 1] = np.nan
df.iloc[2, 3] = np.nan
df.iloc[4, 0] = np.nan

df.head()

          A         B         C         D
0 -1.021807       NaN  3.127118 -0.688312
1  0.099865  0.569101 -0.175541  1.262741
2  1.762798  0.632172  0.295768       NaN
3  0.501899  0.363993 -0.245273 -0.311443
4       NaN -0.953768  0.374065 -1.020661